"""
Задача 2.
Найдите сумму цифр трехзначного числа.

123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0)
"""

n = 123
d1 = n % 10
d2 = n // 100
n = n // 10
d3 = n % 10
print(d1 + d2 + d3)
